{
    "version": "https://jsonfeed.org/version/1",
    "title": "Kresch",
    "description": "",
    "home_page_url": "https://www.kres.ch",
    "feed_url": "https://www.kres.ch/feed.json",
    "user_comment": "",
    "author": {
        "name": "Steven Kreschollek"
    },
    "items": [
        {
            "id": "https://www.kres.ch/on-loss-and-having.html",
            "url": "https://www.kres.ch/on-loss-and-having.html",
            "title": "On Loss and Having",
            "summary": "I started writing this blog in March. For many reasons - namely life just being life - I never got around to publishing this, and now, with the loss of another, I felt it was time to revisit it. It’s always been hard for me&hellip;",
            "content_html": "<p>I started writing this blog in March.</p><p>For many reasons - namely life just being life - I never got around to publishing this, and now, with the loss of another, I felt it was time to revisit it.</p><p>It’s always been hard for me to express the feeling of emptiness that sweeps over me during the loss of a family member.</p><p>We lost my Grandfather, on my dads side, a decade plus ago. It hurts, because I remember the man he was - I wasn’t a child - but mostly, I remember him through my dad. Through the stories he shares of driving through New York traffic with his dad, listening to him complain about the amount of toxins we were pumping in the air, even back then. A true conservative, for whatever worth that word has these days.</p><p>For my moms parents in New York - the story was much the same. I have memories of spending summers there, visting our cousins, and staying at their house. I’ll never forget the smell of dew in a basement, and it will always bring me back to that little white house in Aquebogue. But as the years drag on, so to, do the memories. We lost my Grandfather, my moms dad, the year after I started dating my wife.</p><p>But my Grandmothers - they continued on. Never forgetting their husbands and there lives. And while I remember, throughout the years, the wishes from my Nana that she be returned to her husband, I’m grateful for every moment both of them were with us for. My dads mom didn’t get to come to our wedding - but she got to live through it in pictures and shared laughter. My moms mother did - and danced the night away with her grandchildren.</p><p>But at the end of it all, none of them will truly ever be gone. Our grandparents, our friends, our families, they all live on. In the people they touched. In the kids they raised.</p><p>I wouldn’t be here without them.</p><p>So much of the love and guidance in my life has been from my parents, who by extension wouldn’t have been the people they are without the love of their own.</p><p>❤ and miss you, Nana, Papa, Grandma, and Grampa.</p><p>You raised some good ones.</p>",
            "author": {
                "name": "Steven Kreschollek"
            },
            "tags": [
            ],
            "date_published": "2020-10-26T21:46:00-05:00",
            "date_modified": "2026-01-18T21:52:17-06:00"
        },
        {
            "id": "https://www.kres.ch/mecha-board.html",
            "url": "https://www.kres.ch/mecha-board.html",
            "title": "Mecha-board",
            "summary": "My first real introduction to mechanical keyboards, outside of maybe using them a few times in school at old computer labs, was when I was morking my first job at Walgreens. Even though it was in the 2000’s, Walgreens utilized a POS system powered by&hellip;",
            "content_html": "<p>My first real introduction to mechanical keyboards, outside of maybe using them a few times in school at old computer labs, was when I was morking my first job at Walgreens. Even though it was in the 2000’s, Walgreens utilized a POS system powered by IBM’s AS/400 (they may even still; it’s been a hot minute since I was there). The system in our store had a wonderfully obnoxious Model-M variant attached to it’s console.</p><p>While I had familiary with high-quality (for the time) gaming perpherals, I wasn’t super well versed with mechanical keyboards themselves. Time passed, and when my Razer products (another post for another time) all started giving out, I looked at the market and settled on a <a href=\"https://www.corsair.com/us/en/Categories/Products/Gaming-Keyboards/VENGEANCE%C2%AE-K60-Performance-FPS-Mechanical-Gaming-Keyboard/p/CH-9000004-NA\">Corsair K60</a> as my first truly mechanical keyboard (though the function keys were still membrane).</p><p>It worked well, until it didn’t. </p><p>Keys started giving out, and I needed to look at different options.</p><p>While my Wife and I were dating, I explored other, smaller options, eventually settling on a Poker II with clear switches. That keyboard lasted a long time - staying with me, and finding it’s place as my ‘office’ keyboard of choice at my previous agency.</p><p>My brother still uses that keyboard - it’s built like a tank, and will probably outlast both of us.</p><p>After I left that agency, I decided I wanted a bit of a better setup at home. I ended up ordering the ErgoDox Infinity from Massdrop (now Drop) with Cherry Blue’s. I’m sure it annoys everone on the Zoom calls we all constantly find oursleves on these days - but I love it. It took some getting used to, but the value in a split keyboard to me is tremendous. It feels better. It works better. And I can program the ever livin’ heck out of it.</p><figure class=\"post__image\"><img loading=\"lazy\" src=\"https://www.kres.ch/1.jpg\" alt=\"A surprise visit from your friendly neighborhood Tachikoma\" data-is-external-image=\"true\"></figure><blockquote>\n<p>There are many keyboards like it, but this one is mine.</p></blockquote>\n<p>But I don’t think it’ll be the ‘Endgame (trademark pending, or something)’. The HHKB has been on my list for more years than I care to admit, and while my wallet continunes to say no, my eyes are saying yes.</p>",
            "author": {
                "name": "Steven Kreschollek"
            },
            "tags": [
            ],
            "date_published": "2020-10-02T22:00:00-05:00",
            "date_modified": "2026-01-18T22:03:57-06:00"
        }
    ]
}
